Control_Test/Savonious/Flat/CFD_Test/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet 
    {
        type            calculated;
        value           uniform 0;
    }

    outlet 
    {
        type            calculated;
        value           uniform 0;
    }

    "(VAWT1|VAWT2|VAWT3|SHAFT)"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }


    top
    {
        type            calculated;
        value           uniform 0;
    }

    bottom
    {
        type            calculated;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }


    AMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }

    AMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
