Control_Test/Savonious/Flat/CFD_Test/system/include/Dimensions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

OD			0.45;
ID			0.015;

ID1			#calc "-$ID";
OD1			#calc "-$OD";
ODmid			#calc "$OD/1.41421356237";
ODmid1			#calc "-$OD/1.41421356237";
IDmid			#calc "$ID/1.41421356237";
IDmid1			#calc "-$ID/1.41421356237";


Xmin	     		-1.2;	
Xmax			2.8;
Y             		1.2;	
Z			0.01;


Y1             		#calc "-$Y";	
Z1			#calc "-$Z";








turbulentKE          0.09375;//37
turbulentOmega       6;//7.53887;//1.61;//32


//ODmidarcx	 0.433012702;
//ODmidarcy			0.25;
//ODmidarcx1	 -0.433012702;
//ODmidarcy1			-0.25;


// ************************************************************************* //
